# Выведите все элементы, которые меньше 6

l = [1,3,8,2,9,4,5,7]
i = 0
newl = []

for i in l:
    if i < 6:
        newl.append(i)

print('элементы меньше 6:', newl)

#result = элементы меньше 6: [1, 3, 2, 4, 5]
